app/Models/Usuarios.php

INSERT INTO `usuarios` (`username`, `nombres`, `apellidos`, `password`) VALUES ('user03', 'new', 'user', 'tVsyq7b7UHT6bBAt4wKH649xxoTThYx4erFgyRWhfV0/y32kMGCw0AzgmAfTgqF5dtVdQ99UKYxZ2/xqY+n1H5aWPJ/eImZQD3FDsGdWVp1a4Y7PPvdM')
---
    public function register($data) {
        $Usuario = $this->db->table('usuarios');
        $Usuario->insert($data);